
$varr=0;

$varr++;  //ეს არის ინკრემენტი, ანუ ცვლად varr ში გაიზრდება ციფრი 1 ით
$varr--; //ეს არის დეკრემენტი, ანუ ცვლად varr ში ციფრი შემცირდება 1 ით

//----------

var_dump($something); //ფუნქცია რომელიც აბრუნებს მონაცემთა ტიპს და ღირებულებას

//----------

$a=array("red","green");
array_push($a,"blue","yellow",'rrr'); // array_push() ით ხდება ლისტში ღირებულებების ჩამატება

//-----------
header();      ამ ფუნქციით ხდება საიტის რეფრეში,რედირექტი და ა.შ

header("Refresh:0");  //ციფრი ნიშნავს თუ რამდენ ხანში დარეფრეშდეს

header("Refresh:0; url=page2.php"); // გადამისამართება
//----------

