//მდგომარეობითი სთეითმენთები გამოიყენება რომ განახორციელო სხვადასხვა მოქმედებები სხვადასხვა მდგომარეობებზე დაყრდნობით.
// if სთეითმენთი გაუშვებს კოდს თუ მდგომარეობა ჭეშმარიტია (true)

<?php

if (11 < 20) {              //11 ნაკლებია 20 ზე ასერომ გაეშვება სტრინგი 'have a good day!'             
    echo "Have a good day!";
}
?>

// if...else ის შემთხვევაში თუ ჭეშმარიტია(true) გაეშვება ერთი და თუ მცდარია(false) გაეშვება მეორე
<?php

if (10 > 20) {
    echo "ათი მეტია ოცზე";
} else {
    echo "ათი ნაკელბია ოცზე";
}

?>

// if..elseif..else ის მდგომარეობაში თუ პირველი მდგომარეობა მცდარია გაეშვება მეორე მდგომარეობა და თუ მეორეც მცდარია გაეშვება else 

<?php


if ('10' == "11") {
    echo "არ გამოიტანს ამ სთეითმენთს რადგან 10 არ უდრის 11 ს "; 
} elseif (10 == 10) {
    echo "გამოიტანს ამ სტრინგს რადგან 10 უდრის 10ს";
} else {
    echo "რამე ხვა!";
}
?>



// მეტი მოქმედებების განსახორციელებლად გადავხედოთ 'ლოგიკურ ოპერატორებს','logical operator'
