//ციფრები ანუ ინტეჯერები და ფლოატები
// ინტეჯერია რიცხვები მაგალითად 100, 105 ა.შ
// ფლოატი არის რიცხვები თავისი ნაშთით მაგ: 10.5 . 100.99

//გასათვალისწინებელია რომ თუ მაგალითად, 4-ს გავამრავლებთ 2.5 ზე პასუხი არის 10, მაგრამ შედეგი გამოვა როგორც ფლოატი და არა ინტეჯერი

// ამ ფუნქციებით შევამოწმებთ მონაცემის/ცვლადის ტიპი არის ინტეჯერი თუ არა
// is_int($ramecvladi);
// is_integer(); - იგივე რაც is_int();
// is_long(); - is_int();

<?php
$x = 5985;
var_dump(is_int($x)); // output >> bool(true)

$x = 59.85;
var_dump(is_int($x)); // output >> bool(false)
?>

// ახლა შევამოწმოთ მონაცემის/ცვლადის ტიპი არის ფლოატი თუ არა
// is_float();
// is_double();  იგივე რაც is_float

<?php
// Check if the type of a variable is float 
$x = 10.365;
var_dump(is_float($x)); // output >> bool(true)
?>    			//  ცვლად $x ში გვაქვს ფლოატი ხოდა ფუნქციამაც გამოიტანა, ჭეშმარიტი 



// is_numeric(); ამ ფუნქციით ვიგებთ ცვლადში მონაცემი არის ციფრები თუ არა.
// 
// არაქ მნიშვნელობა ციფრი ინტეჯერ ტაიპშია თუ სტრინგში, თუ ციფრია აუცილებლად გამოიტანს TRUE, ტუ ტექსტია გამოიტანს FALSE

<?php
// Check if the variable is numeric   
$x = 5985;
var_dump(is_numeric($x));         // TRUE

$x = "Hello";
var_dump(is_numeric($x));        // FALSE
?>
