// პჰპ ში ცვლადების დასადეკლარირებლად, დასაწყისში ვიყენებთ $ ს მაგალითად:

<?php
$txt = "Hello world!";
$x = 5;
$y = 10.5;
?>

// ცვლადის სახელი უნდა დაიწყოს ასოთო
// ცვლადის სახელი არ იწყება ციფრით
//ცვლადის სახელი მგრძნობიარეა

// კოდი შეკრიბავს ორ ცვლადს და გამოიტანს ეკრანზე.
<?php
$x = 5;
$y = 4;
echo $x + $y;
?>

//PHP Variables Scope - PHP ცვლადების მაშტაბი
// ცვლადების მაშტაბი არის სკრიპტის ნაწილი თუ სად რა ადგილას იქნება ცვლადი გამოყენებული
// php სწბდ სამი ცვლადბის მაშტაბი , ლოკაური/local,გლობალური/global,სტატიკური/static
// ცვლადი რომელიც დეკლარირებულია ფუნქციის გარეთ ის არის გლობალური და მასზე წვდომა შესაძლებელია მხოლოდ ფუნქციის გარეთ.

<?php
$x = 5; // global scope

function myTest() {
    // using x inside this function will generate an error
    echo "<p>Variable x inside function is: $x</p>";
}
myTest();

echo "<p>Variable x outside function is: $x</p>";
?>

// ფუნქციაში გამოყენებული ცვლადი არ იმუშავებს(არგამოისახება), გარეთ რათქმაუნდაკი. (მაგრამ თუ ფუნქციაში გამოვიყენებთ ქეივორდ global-ს მაშინ იმუშავებს)

// local მაშტაბი არის პირიქით, ანუ ფუნქციაში მუშაობს ცვლადი ფუნქციის გარეთ არა.
